rick1082/sdk-nrf/samples/bluetooth/nrf54l15_unicast_server/src/main.c
/*
 * Copyright (c) 2021-2024 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/* --- Standard includes --- */
#include <errno.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

/* --- Zephyr core includes --- */
#include <zephyr/autoconf.h>
#include <zephyr/kernel.h>
#include <zephyr/net_buf.h>
#include <zephyr/settings/settings.h>
#include <zephyr/sys/__assert.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/sys/printk.h>
#include <zephyr/sys/ring_buffer.h>
#include <zephyr/sys/util.h>
#include <zephyr/sys/util_macro.h>
#include <zephyr/sys_clock.h>
#include <zephyr/types.h>
#include <zephyr/logging/log.h>

/* --- Zephyr driver includes --- */
#include <zephyr/drivers/clock_control/nrf_clock_control.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/pinctrl.h>

/* --- Bluetooth includes --- */
#include <zephyr/bluetooth/addr.h>
#include <zephyr/bluetooth/audio/audio.h>
#include <zephyr/bluetooth/audio/bap.h>
#include <zephyr/bluetooth/audio/lc3.h>
#include <zephyr/bluetooth/audio/mcc.h>
#include <zephyr/bluetooth/audio/media_proxy.h>
#include <zephyr/bluetooth/audio/pacs.h>
#include <zephyr/bluetooth/audio/vcp.h>
#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/byteorder.h>
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/gap.h>
#include <zephyr/bluetooth/hci.h>
#include <zephyr/bluetooth/hci_types.h>
#include <zephyr/bluetooth/iso.h>
#include <zephyr/bluetooth/uuid.h>

/* --- Nordic specific includes --- */
#include <dk_buttons_and_leds.h>
#include <nrfx_clock.h>
#include <nrfx_i2s.h>
#include <pcm_mix.h>
#include "lc3.h"
#include "nrf54l15.h"

#if defined(NRF54L15_XXAA)
#include <hal/nrf_clock.h>
#endif

LOG_MODULE_REGISTER(main, LOG_LEVEL_INF);

/* --- Hardware definitions --- */
#define I2C_NODE DT_NODELABEL(tlv320)
#define I2S_NL DT_NODELABEL(i2s20)

/* --- Audio definitions --- */
#define I2S_SAMPLES_NUM 48  // samples per 1ms block
#define BUFFER_SPACE 20     // 20 buffers = 10ms total
#define MAX_SAMPLE_RATE 48000
#define MAX_FRAME_DURATION_US 10000
#define MAX_NUM_SAMPLES ((MAX_FRAME_DURATION_US * MAX_SAMPLE_RATE) / USEC_PER_SEC)

/* --- Button definitions --- */
#define KEY_LEFT_MASK   DK_BTN1_MSK
#define KEY_UP_MASK     DK_BTN2_MSK
#define KEY_RIGHT_MASK  DK_BTN3_MSK
#define KEY_DOWN_MASK   DK_BTN4_MSK

/* --- Bluetooth Audio Context definitions --- */
#define AVAILABLE_SINK_CONTEXT \
	(BT_AUDIO_CONTEXT_TYPE_UNSPECIFIED | BT_AUDIO_CONTEXT_TYPE_CONVERSATIONAL | \
	 BT_AUDIO_CONTEXT_TYPE_MEDIA | BT_AUDIO_CONTEXT_TYPE_GAME | \
	 BT_AUDIO_CONTEXT_TYPE_INSTRUCTIONAL)

#define AVAILABLE_SOURCE_CONTEXT BT_AUDIO_CONTEXT_TYPE_UNSPECIFIED

/* --- GPIO declarations --- */
static const struct gpio_dt_spec led = GPIO_DT_SPEC_GET(DT_ALIAS(led0), gpios);
static const struct gpio_dt_spec rst = GPIO_DT_SPEC_GET(DT_ALIAS(led3), gpios);
static const struct device *gpio;

/* --- I2S configuration --- */
PINCTRL_DT_DEFINE(I2S_NL);
static nrfx_i2s_t i2s_inst = NRFX_I2S_INSTANCE(20);
static nrfx_i2s_config_t cfg = {
	.skip_gpio_cfg = true,
	.skip_psel_cfg = true,
	.irq_priority = DT_IRQ(I2S_NL, priority),
	.mode = NRF_I2S_MODE_SLAVE,
	.format = NRF_I2S_FORMAT_I2S,
	.alignment = NRF_I2S_ALIGN_LEFT,
	.ratio = NRF_I2S_RATIO_64X,
	.sample_width = NRF_I2S_SWIDTH_16BIT,
	.channels = NRF_I2S_CHANNELS_STEREO,
	.mck_setup = NRF_I2S_MCK_32MDIV2,
};

/* --- I2C configuration --- */
static const struct i2c_dt_spec dev_i2c = I2C_DT_SPEC_GET(I2C_NODE);

/* --- Audio buffers --- */
static uint16_t i2s_tx_buf_a[I2S_SAMPLES_NUM * 2] = {0}; // 2 channels, 16 bits each
static uint16_t i2s_tx_buf_b[I2S_SAMPLES_NUM * 2] = {0};
static uint16_t i2s_rx_buf_a[I2S_SAMPLES_NUM * 2] = {0};
static uint16_t i2s_rx_buf_b[I2S_SAMPLES_NUM * 2] = {0};
RING_BUF_DECLARE(i2s_tx_ring_buf, I2S_SAMPLES_NUM * 2 * sizeof(uint16_t) * BUFFER_SPACE);

/* --- Bluetooth Audio variables --- */
NET_BUF_POOL_FIXED_DEFINE(tx_pool, CONFIG_BT_ASCS_MAX_ASE_SRC_COUNT,
			  BT_ISO_SDU_BUF_SIZE(CONFIG_BT_ISO_TX_MTU),
			  CONFIG_BT_CONN_TX_USER_DATA_SIZE, NULL);

static const struct bt_audio_codec_cap lc3_codec_cap = BT_AUDIO_CODEC_CAP_LC3(
	BT_AUDIO_CODEC_CAP_FREQ_48KHZ, BT_AUDIO_CODEC_CAP_DURATION_10,
	BT_AUDIO_CODEC_CAP_CHAN_COUNT_SUPPORT(2), 80u, 240u, 1u, AVAILABLE_SINK_CONTEXT);

static const struct bt_bap_qos_cfg_pref qos_pref =
	BT_BAP_QOS_CFG_PREF(true, BT_GAP_LE_PHY_2M, 10, 10, 10000, 40000, 10000, 40000);

static struct bt_conn *default_conn;
static struct k_work_delayable audio_send_work;
static struct bt_bap_stream sink_streams[CONFIG_BT_ASCS_MAX_ASE_SNK_COUNT];

static struct audio_source {
	struct bt_bap_stream stream;
	uint16_t seq_num;
	uint16_t max_sdu;
	size_t len_to_send;
} source_streams[CONFIG_BT_ASCS_MAX_ASE_SRC_COUNT];

static size_t configured_source_stream_count;

/* --- LC3 decoder variables --- */
static lc3_decoder_t lc3_decoder[2];
static lc3_decoder_mem_48k_t lc3_decoder_mem[2];
static int frames_per_sdu;

/* --- Volume Control variables --- */
static struct bt_vcp_included vcp_included;

/* --- Advertising variables --- */
static struct bt_le_ext_adv *adv;
static struct k_work adv_work;

static uint8_t unicast_server_addata[] = {
	BT_UUID_16_ENCODE(BT_UUID_ASCS_VAL),
	BT_AUDIO_UNICAST_ANNOUNCEMENT_TARGETED,
	BT_BYTES_LIST_LE16(AVAILABLE_SINK_CONTEXT),
	BT_BYTES_LIST_LE16(AVAILABLE_SOURCE_CONTEXT),
	0x00, /* Metadata length */
};

static const struct bt_data ad[] = {
	BT_DATA_BYTES(BT_DATA_FLAGS, (BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR)),
	BT_DATA_BYTES(BT_DATA_UUID16_ALL, BT_UUID_16_ENCODE(BT_UUID_ASCS_VAL)),
	BT_DATA(BT_DATA_SVC_DATA16, unicast_server_addata, ARRAY_SIZE(unicast_server_addata)),
	BT_DATA(BT_DATA_NAME_COMPLETE, CONFIG_BT_DEVICE_NAME, sizeof(CONFIG_BT_DEVICE_NAME) - 1),
};

/* --- Function prototypes --- */
int mcp_send_cmd(uint8_t mcp_opcode);

/* --- I2C helper functions --- */
void dac_i2c_write(const struct i2c_dt_spec *dev_i2c, uint8_t reg, uint8_t value)
{
	int ret;
	uint8_t config[2] = {reg, value};

	ret = i2c_write_dt(dev_i2c, config, sizeof(config));
	if (ret != 0) {
		printf("Failed to write to I2C device address %x at reg. %x\n", dev_i2c->addr, reg);
	} else {
		// printf("I2C device address %x at reg. %x written successfully\n", dev_i2c->addr,
		//        reg);
	}
}

void tlv320_setup(void)
{

	if (!device_is_ready(dev_i2c.bus)) {
		printf("I2C bus %s is not ready!\n", dev_i2c.bus->name);
		return;
	} else {
		printf("I2C bus %s is ready!\n", dev_i2c.bus->name);
	}

	dac_i2c_write(&dev_i2c, 0x00, 0x00);

	dac_i2c_write(&dev_i2c, 0x01, 0x01);
	k_sleep(K_MSEC(10));

	dac_i2c_write(&dev_i2c, 0x04, 0x03 | (0b11 << 0));
	dac_i2c_write(&dev_i2c, 0x05, (0b001 << 4) | (0b0001 << 0));
	dac_i2c_write(&dev_i2c, 0x06, 0x05);
	dac_i2c_write(&dev_i2c, 0x07, 0x0E);
	dac_i2c_write(&dev_i2c, 0x08, 0xB0);

