rick1082/sdk-nrf/samples/bluetooth/nrf54l15_unicast_server/src/main.c
	dac_i2c_write(&dev_i2c, 0x05, (1 << 7) | (0b001 << 4) | (0b0001 << 0));
	k_sleep(K_MSEC(15));

	dac_i2c_write(&dev_i2c, 0x0B, 0x87);
	dac_i2c_write(&dev_i2c, 0x0C, 0x82);
	dac_i2c_write(&dev_i2c, 0x0D, 0x00);
	dac_i2c_write(&dev_i2c, 0x0E, 0x80);

	dac_i2c_write(&dev_i2c, 0x1B, 0x0C);
	dac_i2c_write(&dev_i2c, 0x1E, 0x84);
	dac_i2c_write(&dev_i2c, 0x1D, (0b01 << 0));
	dac_i2c_write(&dev_i2c, 0x3C, 0x01);
	dac_i2c_write(&dev_i2c, 0x74, 0x00);

	dac_i2c_write(&dev_i2c, 0x00, 0x01);
	dac_i2c_write(&dev_i2c, 0x1F, (0b00 << 3));
	dac_i2c_write(&dev_i2c, 0x21, (0b0111 << 3) | (0b11 << 1));
	dac_i2c_write(&dev_i2c, 0x23, 0x44);
	dac_i2c_write(&dev_i2c, 0x24, 0x80);
	dac_i2c_write(&dev_i2c, 0x25, 0x80);
	dac_i2c_write(&dev_i2c, 0x28, 0x06);
	dac_i2c_write(&dev_i2c, 0x29, 0x06);
	dac_i2c_write(&dev_i2c, 0x1F, 0xC0 | (0b00 << 3));
	// dac_i2c_write(&dev_i2c, 0x20, 0x80);

	k_sleep(K_MSEC(300));

	dac_i2c_write(&dev_i2c, 0x00, 0x00);
	dac_i2c_write(&dev_i2c, 0x3F, 0xD4);
	dac_i2c_write(&dev_i2c, 0x41, -60);
	dac_i2c_write(&dev_i2c, 0x42, -60);
	dac_i2c_write(&dev_i2c, 0x40, 0x00);
	dac_i2c_write(&dev_i2c, 0x00, 0x00);
}

/* --- I2S functions --- */
void audio_i2s_set_next_buf(const uint8_t *tx_buf, uint32_t *rx_buf)
{
	const nrfx_i2s_buffers_t i2s_buf = {.p_rx_buffer = rx_buf,
					    .p_tx_buffer = (uint32_t *)tx_buf,
					    .buffer_size = I2S_SAMPLES_NUM};

	nrfx_err_t ret;

	ret = nrfx_i2s_next_buffers_set(&i2s_inst, &i2s_buf);
	if (ret != NRFX_SUCCESS) {
		printf("Failed to set next buffers: %x\n", ret);
	}
}

static void i2s_comp_handler(nrfx_i2s_buffers_t const *released_bufs, uint32_t status)
{
	int ret;

	if (status == NRFX_I2S_STATUS_NEXT_BUFFERS_NEEDED) {
		if ((uint16_t *)released_bufs->p_tx_buffer == i2s_tx_buf_a) {
			ret = ring_buf_get(&i2s_tx_ring_buf, (uint8_t *)i2s_tx_buf_a,
					   I2S_SAMPLES_NUM * 2 * sizeof(uint16_t));
			if (ret != 192) {
				memset(i2s_tx_buf_a, 0, 192);
			}
			audio_i2s_set_next_buf((const uint8_t *)i2s_tx_buf_a,
					       (uint32_t *)i2s_rx_buf_a);
		} else if ((uint16_t *)released_bufs->p_tx_buffer == i2s_tx_buf_b) {
			ret = ring_buf_get(&i2s_tx_ring_buf, (uint8_t *)i2s_tx_buf_b,
					   I2S_SAMPLES_NUM * 2 * sizeof(uint16_t));
			if (ret != 192) {
				memset(i2s_tx_buf_b, 0, 192);
			}
			audio_i2s_set_next_buf((const uint8_t *)i2s_tx_buf_b,
					       (uint32_t *)i2s_rx_buf_b);
		}
	}
}

void audio_i2s_start(const uint8_t *tx_buf, uint32_t *rx_buf)
{
	const nrfx_i2s_buffers_t i2s_buf = {.p_rx_buffer = rx_buf,
					    .p_tx_buffer = (uint32_t *)tx_buf,
					    .buffer_size = I2S_SAMPLES_NUM};

	int ret;

	/* Buffer size in 32-bit words */
	ret = nrfx_i2s_start(&i2s_inst, &i2s_buf, 0);
	if (ret != NRFX_SUCCESS) {
		printf("Failed to start I2S: %d\n", ret);
	}
}

void audio_i2s_init(void)
{
	int ret;

	ret = pinctrl_apply_state(PINCTRL_DT_DEV_CONFIG_GET(I2S_NL), PINCTRL_STATE_DEFAULT);
	if (ret != 0) {
		printf("Failed to apply pinctrl state: %d\n", ret);
		return;
	}

	IRQ_CONNECT(DT_IRQN(I2S_NL), DT_IRQ(I2S_NL, priority), nrfx_isr, nrfx_i2s_20_irq_handler,
		    0);
	irq_enable(DT_IRQN(I2S_NL));

	ret = nrfx_i2s_init(&i2s_inst, &cfg, i2s_comp_handler);
	if (ret != NRFX_SUCCESS) {
		printf("Failed to initialize I2S: %x\n", ret);
		return;
	}
}

/* --- Clock management --- */
static int clocks_start(void)
{
	int err;
	int res;
	struct onoff_manager *clk_mgr;
	struct onoff_client clk_cli;

	clk_mgr = z_nrf_clock_control_get_onoff(CLOCK_CONTROL_NRF_SUBSYS_HF);
	if (!clk_mgr) {
		printf("Unable to get the Clock manager\n");
		return -ENXIO;
	}

	sys_notify_init_spinwait(&clk_cli.notify);

	err = onoff_request(clk_mgr, &clk_cli);
	if (err < 0) {
		printf("Clock request failed: %d\n", err);
		return err;
	}

	do {
		err = sys_notify_fetch_result(&clk_cli.notify, &res);
		if (!err && res) {
			printf("Clock could not be started: %d\n", res);
			return res;
		}
	} while (err);

#if defined(NRF54L15_XXAA)
	/* MLTPAN-20 */
	nrf_clock_task_trigger(NRF_CLOCK, NRF_CLOCK_TASK_PLLSTART);
#endif /* defined(NRF54L15_XXAA) */

	printf("HF clock started\n");
	return 0;
}

/* --- Utility functions --- */
void print_hex(const uint8_t *ptr, size_t len)
{
	while (len-- != 0) {
		printk("%02x", *ptr++);
	}
}

static bool print_cb(struct bt_data *data, void *user_data)
{
	const char *str = (const char *)user_data;

	LOG_INF("%s: type 0x%02x value_len %u", str, data->type, data->data_len);
	LOG_HEXDUMP_INF(data->data, data->data_len, "value:");

	return true;
}

static void print_codec_cfg(const struct bt_audio_codec_cfg *codec_cfg)
{
	LOG_INF("codec_cfg 0x%02x cid 0x%04x vid 0x%04x count %u", codec_cfg->id, codec_cfg->cid,
		codec_cfg->vid, codec_cfg->data_len);

	if (codec_cfg->id == BT_HCI_CODING_FORMAT_LC3) {
		enum bt_audio_location chan_allocation;
		int ret;

		/* LC3 uses the generic LTV format - other codecs might do as well */

		bt_audio_data_parse(codec_cfg->data, codec_cfg->data_len, print_cb, "data");

		ret = bt_audio_codec_cfg_get_freq(codec_cfg);
		if (ret > 0) {
			LOG_INF("  Frequency: %d Hz", bt_audio_codec_cfg_freq_to_freq_hz(ret));
		}

		ret = bt_audio_codec_cfg_get_frame_dur(codec_cfg);
		if (ret > 0) {
			LOG_INF("  Frame Duration: %d us",
				bt_audio_codec_cfg_frame_dur_to_frame_dur_us(ret));
		}

		ret = bt_audio_codec_cfg_get_chan_allocation(codec_cfg, &chan_allocation, false);
		if (ret == 0) {
			LOG_INF("  Channel allocation: 0x%x", chan_allocation);
		}

		LOG_INF("  Octets per frame: %d (negative means value not pressent)",
			bt_audio_codec_cfg_get_octets_per_frame(codec_cfg));
		LOG_INF("  Frames per SDU: %d",
			bt_audio_codec_cfg_get_frame_blocks_per_sdu(codec_cfg, true));
	} else {
		print_hex(codec_cfg->data, codec_cfg->data_len);
	}

	bt_audio_data_parse(codec_cfg->meta, codec_cfg->meta_len, print_cb, "meta");
}

static void print_qos(const struct bt_bap_qos_cfg *qos)
{
	LOG_INF("QoS: interval %u framing 0x%02x phy 0x%02x sdu %u "
		"rtn %u latency %u pd %u",
		qos->interval, qos->framing, qos->phy, qos->sdu, qos->rtn, qos->latency, qos->pd);
}

/* --- Volume Control callbacks --- */
static void vcs_state_cb(struct bt_conn *conn, int err, uint8_t volume, uint8_t mute)
{
	if (err) {
		printk("VCS state get failed (%d)\n", err);
	} else {
		printk("VCS volume %u, mute %u\n", volume, mute);
		dac_i2c_write(&dev_i2c, 0x41, (int8_t)(volume-127));
		dac_i2c_write(&dev_i2c, 0x42, (int8_t)(volume-127));
	}
}

