rick1082/sdk-nrf/samples/bluetooth/nrf54l15_unicast_server/src/main.c
	return 0;
}

static int lc3_stop(struct bt_bap_stream *stream, struct bt_bap_ascs_rsp *rsp)
{
	LOG_INF("Stop: stream %p", (void *)stream);

	return 0;
}

static int lc3_release(struct bt_bap_stream *stream, struct bt_bap_ascs_rsp *rsp)
{
	LOG_INF("Release: stream %p", (void *)stream);
	return 0;
}

static struct bt_bap_unicast_server_register_param param = {
	CONFIG_BT_ASCS_MAX_ASE_SNK_COUNT,
	CONFIG_BT_ASCS_MAX_ASE_SRC_COUNT
};

static const struct bt_bap_unicast_server_cb unicast_server_cb = {
	.config = lc3_config,
	.reconfig = lc3_reconfig,
	.qos = lc3_qos,
	.enable = lc3_enable,
	.start = lc3_start,
	.metadata = lc3_metadata,
	.disable = lc3_disable,
	.stop = lc3_stop,
	.release = lc3_release,
};

/* --- Stream operations --- */
static void stream_recv_lc3_codec(struct bt_bap_stream *stream, const struct bt_iso_recv_info *info,
				  struct net_buf *buf)
{
	bool valid_data = (info->flags & BT_ISO_FLAGS_VALID) != 0;
	const int octets_per_frame = buf->len / frames_per_sdu;

	for (int i = 0; i < 2; i++) {
		if (lc3_decoder[i] == NULL) {
			LOG_INF("LC3 decoder not setup, cannot decode data.");
			return;
		}
	}

	if (buf->len == 0) {
		LOG_INF("Received empty buffer");
		valid_data = false;
	}

	if (!valid_data) {
		LOG_INF("Bad packet: 0x%02X", info->flags);
	}

	int16_t audio_buf_test[2 * 480];
	// LOG_INF("RX stream %p len %u", stream, buf->len);
	uint16_t buf_size;
	static uint16_t prev_buf_size = 0;

	buf_size = ring_buf_space_get(&i2s_tx_ring_buf);
	if (buf_size != prev_buf_size) {
		prev_buf_size = buf_size;
		//LOG_INF("I2S TX ring buffer space: %d bytes", buf_size);
		int16_t buf_size_percent = buf_size * 100 / (I2S_SAMPLES_NUM * 2 * sizeof(uint16_t) * BUFFER_SPACE);
		//LOG_INF("FIFO state%d", buf_size_percent);
		if (buf_size_percent < 45) {
			dac_i2c_write(&dev_i2c, 0x07, 0x0E); // D[13:8] for D=3760
		    dac_i2c_write(&dev_i2c, 0x08, 0xDA); // D[7:0] for D=3760
		} else if (buf_size_percent >= 40 && buf_size_percent <= 55) {
			dac_i2c_write(&dev_i2c, 0x07, 0x0E); // D[13:8] for D=3760
			dac_i2c_write(&dev_i2c, 0x08, 0xB0); // D[7:0] for D=3760
		} else {
			dac_i2c_write(&dev_i2c, 0x07, 0x0E); // D[13:8] for D=3760
		    dac_i2c_write(&dev_i2c, 0x08, 0x86); // D[7:0] for D=3760
		}
	}

	for (int i = 0; i < frames_per_sdu; i++) {
		for (int j = 0; j < 2; j++) {
			const int err = lc3_decode(
				lc3_decoder[j],
				valid_data ? net_buf_pull_mem(buf, octets_per_frame / 2) : NULL,
				octets_per_frame / 2, LC3_PCM_FORMAT_S16, audio_buf_test + j, 2);
			if (err == 1) {
				LOG_DBG("[%d]: Decoder performed PLC", i);
			} else if (err < 0) {
				LOG_INF("[%d]: Decoder failed - wrong parameters?: %d", i, err);
			}
		}
	}
	ring_buf_put(&i2s_tx_ring_buf, (uint8_t *)audio_buf_test, 480 * 2 * sizeof(int16_t));
}

static void stream_stopped(struct bt_bap_stream *stream, uint8_t reason)
{
	LOG_INF("Audio Stream %p stopped with reason 0x%02X", (void *)stream, reason);

	/* Stop send timer */
	k_work_cancel_delayable(&audio_send_work);
}

static void stream_started(struct bt_bap_stream *stream)
{
	LOG_INF("Audio Stream %p started", (void *)stream);
}

static void stream_enabled_cb(struct bt_bap_stream *stream)
{
	/* The unicast server is responsible for starting sink ASEs after the
	 * client has enabled them.
	 */
	if (stream_dir(stream) == BT_AUDIO_DIR_SINK) {
		const int err = bt_bap_stream_start(stream);

		if (err != 0) {
			LOG_INF("Failed to start stream %p: %d", (void *)stream, err);
		}
	}
}

static struct bt_bap_stream_ops stream_ops = {
	.recv = stream_recv_lc3_codec,
	.stopped = stream_stopped,
	.started = stream_started,
	.enabled = stream_enabled_cb,
};

/* --- Advertising functions --- */
static void advertising_process(struct k_work *work)
{
	int err;
	err = bt_le_ext_adv_start(adv, BT_LE_EXT_ADV_START_DEFAULT);
	if (err) {
		LOG_INF("Failed to start advertising set (err %d)", err);
	}
	LOG_INF("Advertising successfully started");
}

/* --- Media Control functions --- */
static void mcc_discover_mcs_cb(struct bt_conn *conn, int err)
{
	LOG_WRN("MCP: MCS discovery complete callback");
	if (err) {
		printk("MCP: Discovery of MCS failed (%d)\n", err);
	} else {
		printk("MCP: Discovered MCS\n");
	}
}

static void mcc_send_command_cb(struct bt_conn *conn, int err, const struct mpl_cmd *cmd)
{
	if (err) {
		printk("MCP: Command send failed (%d) - opcode: %u, param: %d\n",
			err, cmd->opcode, cmd->param);
	} else {
		printk("MCP: Successfully sent command (%d) - opcode: %u, param: %d\n",
			err, cmd->opcode, cmd->param);
	}
}

static struct bt_mcc_cb mcc_cb = {
	.discover_mcs = mcc_discover_mcs_cb,
	.send_cmd = mcc_send_command_cb,
};

int mcp_ctlr_init(struct bt_conn *conn)
{
	int err;

	default_conn = bt_conn_ref(conn);

	err = bt_mcc_init(&mcc_cb);
	if (err != 0) {
		return err;
	}

	err = bt_mcc_discover_mcs(default_conn, true);

	return err;
}

int mcp_send_cmd(uint8_t mcp_opcode)
{
	int err;
	struct mpl_cmd cmd;

	cmd.opcode = mcp_opcode;
	cmd.use_param = false;

	if (default_conn == NULL) {
		printk("MCP: No connection\n");
		return -EINVAL;
	}

	err = bt_mcc_send_cmd(default_conn, &cmd);
	if (err != 0) {
		printk("MCP: Command failed: %d\n", err);
	}

	return err;
}

/* --- Connection callbacks --- */
static void connected(struct bt_conn *conn, uint8_t err)
{
	char addr[BT_ADDR_LE_STR_LEN];

	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

	if (err != 0) {
		LOG_INF("Failed to connect to %s %u %s", addr, err, bt_hci_err_to_str(err));

		default_conn = NULL;
		return;
	}

	LOG_INF("Connected: %s", addr);

	default_conn = bt_conn_ref(conn);
}

static void disconnected(struct bt_conn *conn, uint8_t reason)
{
	char addr[BT_ADDR_LE_STR_LEN];

	if (conn != default_conn) {
		return;
	}

	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

	LOG_INF("Disconnected: %s, reason 0x%02x %s", addr, reason, bt_hci_err_to_str(reason));

	bt_conn_unref(default_conn);
	default_conn = NULL;

	configured_source_stream_count = 0;
	k_work_cancel_delayable(&audio_send_work);

